<a href="https://colab.research.google.com/github/barcellfe/datascience_study/blob/master/Aula_03_11_2020_Pandas_II.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Aula 03-11-2020

Como vimos na aula passada, a biblioteca pandas tem alguns componentes que são elementares:

1.  pd.Series -> Para casos univariados
2.  pd.DataFrame -> Para casos multivariados 
3.  df.index é a palavra mais importante dentro do pandas porque é quem controla a posição dos elementos do DataFrame
4.  Para modificar o índice do DataFrame, basta usar o comando df.reindex

Vejamos agora mais alguns casos da biblioteca Pandas

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [ ]:
# pop = {'Nevada': {2001: 2.4, 2002: 2.9},
#       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
# frame3 = pd.DataFrame(pop)
# frame3

In [ ]:
pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
       'Ohio' : {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [ ]:
frame3 = pd.DataFrame(pop)

In [ ]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [ ]:
##Transposta de um DF
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [ ]:
##reindexando, a partir da reconstrução de um frame
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [ ]:
##podemos fazer do mesmo modo a partir de um objeto do tipo series
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [ ]:
##Para modificar campos de nome, usamos os campos df.index.name e df.columns.name para os casos respectivos
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [ ]:
##os valores saem nos campos df.values
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

**Exercícios**
Tabela 5-1
Como o Pandas lê cada tipo de estrutura dentro do Python

In [ ]:
import numpy as np
# CASO 1:
obj_1 = np.array(np.random.randn(100).reshape(10, 10))
pd.DataFrame(obj_1, index = list('ABCDEFGHIJ'),  columns = ['a1', 'b1', 'c1', 'd1', 'e1', 'f1', 'g1', 'h1', 'i1', 'j1'])

         a1        b1        c1  ...        h1        i1        j1
A  0.413513 -1.688268 -0.203452  ... -0.618379  1.242410  1.713917
B -0.121162 -0.230198 -0.552691  ... -0.152106 -0.444982  0.413442
C  0.522799  0.568547  0.237829  ... -2.459368 -0.385511  2.049655
D  0.646392  1.010913 -1.246675  ...  2.148201 -0.434990 -0.261742
E -0.960588  0.610889 -0.149682  ...  0.468078  0.193063  0.263102
F -0.012434 -0.159977 -0.784740  ...  0.399054 -0.040258 -0.316806
G  1.371859  0.493581 -1.463623  ...  0.284377  0.875545  1.042298
H -1.694087  0.156941 -1.180755  ... -1.353098  0.579266 -0.348412
I -1.981967  0.120426  0.316809  ...  0.664197 -0.401328  0.765415
J  0.855313 -0.931658 -0.071129  ...  1.126496 -0.091673 -1.029454

[10 rows x 10 columns]

In [ ]:
# Outra opção 
obj_1A = np.array(np.random.randn(100).reshape(10, 10))
pd.DataFrame(obj_1A, index = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10'],  columns = ['a1', 'b1', 'c1', 'd1', 'e1', 'f1', 'g1', 'h1', 'i1', 'j1'])

          a1        b1        c1  ...        h1        i1        j1
1   0.002389  1.493132  0.046499  ... -0.135904  0.567647  0.062991
2   0.796502 -0.223446 -0.895053  ... -0.140525  1.278600  1.350776
3  -1.109761  0.695376  1.135788  ... -1.106262 -1.036516  0.162286
4  -0.796116  0.677831  0.608052  ...  1.354681 -0.536759  1.368754
5   0.331879 -0.778718 -0.800341  ...  1.595229 -0.955565  0.089104
6   0.071066 -0.080638  0.254469  ... -0.066006 -0.108732  0.144910
7   0.637902  0.879582  0.103941  ... -0.325265  1.088307 -0.989443
8  -0.081596  0.493093  0.647172  ...  0.109271  1.261147  0.389035
9  -0.298433  1.102553 -0.715039  ...  0.914177 -0.581728  1.664696
10 -0.143261 -0.166269  0.095358  ... -0.112166 -0.240600 -0.222339

[10 rows x 10 columns]

In [ ]:
##Caso 3:

obj_3 = {'Ano': [2000, 2000, 2000, 2000, 2000, 200],
         'Mes': ['01', '02', '03', '04', '05', '06'],
         'Dia': ['01', '01', '01', '01', '01', '01']}
obj_3 = pd.DataFrame(obj_3)
obj_3

    Ano Mes Dia
0  2000  01  01
1  2000  02  01
2  2000  03  01
3  2000  04  01
4  2000  05  01
5   200  06  01

In [ ]:
#Depois do intervalo
frame = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a', 'b', 'c'], columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [ ]:
# Usando o Drop
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['One', 'Two', 'Three', 'Four'])

In [ ]:
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.drop('Two', axis = 1)

          One  Three  Four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns = ['One', 'Two', 'Three', 'Four'])
data

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data['Two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: Two, dtype: int64

In [ ]:
data.Two

Ohio         1
Colorado     5
Utah         9
New York    13
Name: Two, dtype: int64

In [ ]:
data[:2]

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
data[2:]

          One  Two  Three  Four
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data['Three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: Three, dtype: bool

In [ ]:
data[data < 5] = 0
data

          One  Two  Three  Four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
# loc e iloc
data.loc['Colorado', ['Two', 'Three']]

Two      5
Three    6
Name: Colorado, dtype: int64

In [ ]:
data.iloc[1, [1,2]]

Two      5
Three    6
Name: Colorado, dtype: int64

In [ ]:
data.iloc[[1,2],[1,2]]

          Two  Three
Colorado    5      6
Utah        9     10

In [9]:
##Mapeamento de funções
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -2.154837 -0.034374 -0.485946
Ohio    0.875319  0.817542  1.587304
Texas  -0.149694 -0.886051 -0.696169
Oregon -0.871311 -0.762281 -1.398175

In [4]:
##vamos criar uma função que calcula o minimo e o maximo para cada elemento
def f(x):
  return pd.Series([x.min(), x.max()], index = ['min', 'max'])
frame.apply(f)

            b         d         e
min -0.411513 -2.618351 -0.998228
max  2.259579  1.873539 -0.289924

In [ ]:
## exemplo do uso de função, pegando apenas dois dígitos usando applymap

In [5]:
format = lambda x: '%.2f' %x
frame.applymap(format)

            b      d      e
Utah     0.91  -2.62  -0.63
Ohio    -0.41   1.87  -0.88
Texas    2.26  -0.50  -1.00
Oregon  -0.18   0.45  -0.29

# Exercício 03-11-2020

In [34]:
##exercicio criar uma função que contenha da biblioteca stats as funções de estatística decritiva: 
##média, moda, desvio padrão, variancia e mediana
##e aplicar num dataset

import statistics as st

In [35]:
# usar este frame para o teste

frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.726803 -0.529185  0.626949
Ohio   -0.037630  0.377034  1.386253
Texas   0.425310  0.145216 -1.194033
Oregon -0.842377 -0.061905 -2.481947

In [36]:
# função média

def fm(x):
  return pd.Series([st.mean(x)], index = ['media'])
 
frame.apply(fm)

              b        d         e
media -0.295375 -0.01721 -0.415695

In [37]:
# função mediana

def fmed(x):
  return pd.Series([st.median(x)], index = ['mediana'])
 
frame.apply(fmed)

                b         d         e
mediana -0.382216  0.041656 -0.283542

In [38]:
# função variança

def fvar(x):
  return pd.Series([st.variance(x)], index = ['variança'])
 
frame.apply(fvar)

                 b         d         e
variança  0.357054  0.148642  3.069777

In [39]:
# função Desvio Parão

def fdesvp(x):
  return pd.Series([st.stdev(x)], index = ['Desvio Padrão'])
 
frame.apply(fdesvp)

                     b         d         e
Desvio Padrão  0.59754  0.385542  1.752078

In [33]:
# maneira mais fácil
frame.describe()

              b         d         e
count  4.000000  4.000000  4.000000
mean  -0.441086  0.265017 -0.000763
std    0.585677  0.775499  0.316631
min   -1.243748 -0.309259 -0.337241
25%   -0.689546 -0.185596 -0.226995
50%   -0.282357 -0.014505 -0.004827
75%   -0.033897  0.436108  0.221405
max    0.044118  1.398334  0.343844

In [40]:
# agroa fazendo com outros dados que possuem Moda
frame2 = np.random.randint(0, 10, 25).reshape(5,5)
frame2

array([[0, 8, 7, 1, 8],
       [1, 6, 1, 9, 7],
       [0, 6, 6, 1, 7],
       [7, 0, 6, 0, 0],
       [6, 3, 4, 4, 6]])

In [42]:
# colocando em DT
frame2 = pd.DataFrame(frame2, columns = list('BDFHJ'), index = ['Utah', 'Ohio', 'Texas', 'Oregon', 'Michigan'])
frame2

          B  D  F  H  J
Utah      0  8  7  1  8
Ohio      1  6  1  9  7
Texas     0  6  6  1  7
Oregon    7  0  6  0  0
Michigan  6  3  4  4  6

In [44]:
# função Moda

def fmod(x):
  return pd.Series([st.mode(x)], index = ['Moda'])
 
frame2.apply(fmod)

      B  D  F  H  J
Moda  0  6  6  1  7